{
    "id": "SQ-HARD-CONCORDAT",
    "title": "The Concordat Reckoning",
    "difficulty": "Hard",
    "xp_reward": 2600,
    "thread": "Vermin",
    "district": "Deep Archive",
    "estimated_duration": "3-4 sessions",
    "prerequisites": {
        "quests_completed": [
            "SQ-174",
            "SQ-004"
        ],
        "items_required": [
            "Doctor Vane's Personnel File"
        ],
        "district_reputation": {},
        "status_effects": []
    },
    "unlock_conditions": "Complete SQ-M-CONCORDAT and SQ-04; hold Doctor Vane's Personnel File",
    "location": "Deep Archive sub-levels (previously inaccessible); specifically the Concordat Preservation Sanctum, the Bio-Forge Chamber, and the Director's Archive Control Station",
    "npcs": [
        {
            "name": "Doctor Vane Aris",
            "role": "Boss and potential ally",
            "description": "200+ years old, heavily augmented with Concordat life-extension technology, Director of the Concordat's EMBER-PRESERVE project. His augmentations are visible: joint-replacements of brass and copper, eyes that have been optically upgraded, a voice modulator over his throat. He moves carefully, with the deliberateness of someone managing a body that has been repaired many times. He is not a villain in his own narrative. He is a custodian who made extreme choices to complete a mission that has lasted 200 years. If the party has completed the Chronos thread: he knows them, is relieved they found him, and will explain everything. If they have not: he is cautious, evaluating whether they are Concordat-compatible or a threat. Either way, he will not fight first."
        },
        {
            "name": "The Concordat WARDEN System",
            "role": "Environmental antagonist",
            "description": "The Deep Archive's autonomous defense infrastructure. Not AI -- a very sophisticated set of automated responses designed to neutralize biological threats to the Archive's preserved materials. It does not negotiate. It does not de-escalate. It responds to movement, arcane signatures, and biological temperature in the restricted zones. It is the reason the Deep Archive has been inaccessible. Vane can override it. He will not do so automatically."
        },
        {
            "name": "Archivist-Autonomous Unit CIPHER",
            "role": "Intelligence NPC",
            "description": "One of nine archive-maintenance units Vane created to manage the Deep Archive in his absence. CIPHER is the only one that functions; the others degraded over 200 years. It serves as the WARDEN System's interface point and as Vane's communication system. It is not sapient but it communicates in precise language and can provide the party with indexed information about the Archive's contents on request. It will not lie, but it will only provide information that matches the query parameters."
        }
    ],
    "description": "Doctor Vane Aris has been in the Deep Archive sub-levels for 200 years. Evidence from the Vermin thread (SQ-M-CONCORDAT) and the preliminary investigation (SQ-04) has pointed toward a facility beneath the city's known infrastructure level -- a Concordat research installation that was never decommissioned because its director never left. Vane's mission, as the party understands it from available evidence: the Concordat's EMBER-PRESERVE project was described in recovered documents as a 'human preservation and reactivation protocol' intended to ensure humanity's survival through an unspecified catastrophic event. The 200 years of vermin-biology research -- the copper-tails, the bio-forges, the enhanced rat populations -- serve the EMBER-PRESERVE agenda in ways the party must now discover firsthand. The Deep Archive's autonomous defense systems are the mechanical obstacle. Vane himself is the moral one.",
    "mechanics": [
        "WARDEN System navigation (the Archive's autonomous defenses; three types: Thermal-Seekers that respond to biological warmth, Arcane-Suppressors that neutralize magical ability in 10-foot radius, and Physical-Locks that seal corridor sections based on movement patterns; all can be disabled through Engineering DC 15 or Arcana DC 14 at each encounter-point, or overridden if Vane authorizes)",
        "Stealth/Investigation (map the Deep Archive sub-levels; the WARDEN encounters require either combat-bypass or CIPHER-data to anticipate; CIPHER provides accurate environmental data if queried correctly -- Investigation DC 13 to form useful queries)",
        "Medicine/Arcana (analyze Vane's augmentations; understand the EMBER-PRESERVE biological research; key to understanding the 'restart humanity' vs. 'protective caretaker' distinction)",
        "History/Arcana (decode the Concordat's 200-year research record; this is the primary intelligence-gathering mechanic of the Archive sub-levels; each successful check provides a piece of the full picture)",
        "Combat: WARDEN System Constructs (AC 16, HP 65, immune to charm/fear; Physical-Lock Constructs grapple on hit, Strength DC 16 to break; Arcane-Suppressor Constructs emit a continuous pulse in 10-foot radius -- spellcasting in range requires DC 14 CON concentration check; destroyed WARDEN units do not regenerate)",
        "Combat: Doctor Vane Enhanced (if combat initiated; AC 18 from augmentation-armor; HP 180; summons vermin types by whistling through his voice modulator -- standard copper-tail rats, 1d6 of them per summon, appear within 30 feet; Bioelectric Pulse 3/day -- 40-foot cone, 5d10 lightning, DC 16 DEX for half; does not initiate combat unless attacked or cornered)"
    ],
    "permanent_effects": [
        {
            "trigger": "Vane killed",
            "effect": "settlement_stability +1; Concordat ended permanently; all vermin-biology research ceases; potential cures for Scourge-related biological threats are lost; copper-tail cooperative protocol not activated; the Deep Archive is now the party's to explore without active opposition; long-term consequence: a biological threat Vane was monitoring escalates in 6 months"
        },
        {
            "trigger": "Vane joined (party becomes Concordat agents)",
            "effect": "settlement_stability +2; party gains Concordat Access Codes and augmentation questline; Vane reveals full EMBER-PRESERVE agenda; copper-tail network becomes party intelligence resource; the party is now operating under asymmetric information from the rest of the city"
        },
        {
            "trigger": "Vane imprisoned",
            "effect": "settlement_stability +2; Concordat continues in secret under CIPHER's management; trial is not politically viable (Vane's 200-year status is legally unprecedented); bio-aug serum is available from Archive stocks; Vane cooperates with city medical establishment on cures without revealing full EMBER-PRESERVE scope; copper-tail network becomes city intelligence asset"
        }
    ],
    "turns": [
        {
            "turn": 1,
            "narrative": "The access point is at the bottom of a maintenance shaft in the lowest accessible level of the Archive of Deep Records -- Briss's domain. She does not know the shaft exists; it predates her appointment by 180 years. The shaft's entrance is behind a wall section that the party has identified through Doctor Vane's Personnel File: the file's final page, apparently a carbon-ink accidental imprint from a document placed on top of it, shows a partial diagram of something labeled 'EMBER-PRESERVE FACILITY ACCESS -- LEVEL MINUS-4.' The party has translated the coordinates to a physical location. The wall section is sealed with a Concordat lock that matches the access-code format in the Personnel File. Arcana DC 12 to apply the code correctly. The wall opens without drama, inward, revealing a descent shaft with actively-lit Concordat lighting -- the facility is powered and operational.",
            "choice_a": "Descend immediately -- the lit facility means active opposition but also that Vane may be present",
            "consequence_a": "The descent shaft is 60 feet. At the base: a WARDEN System Thermal-Seeker unit is waiting -- it registered the door opening. Combat or bypass (Engineering DC 15 to shut down the Thermal-Seeker at the base of the shaft before landing). The facility's layout is immediately visible: a corridor extending in both directions, Concordat signage, and the distant sound of biological movement (not threatening; it sounds like small animals).",
            "choice_b": "Gather additional intelligence about the facility before descending",
            "consequence_b": "Investigation DC 14 with the Personnel File and any Concordat documents obtained from the Vermin thread. Success determines the pre-knowledge state going in: the party learns the three facility sections (WARDEN Defense Ring, Research Archive, Director's Station), the approximate count of WARDEN units (9 remaining, of which 4 are in the Defense Ring, 3 in the Research Archive, 2 at the Director's Station), and the CIPHER unit's query protocol. Advantage on first three WARDEN bypass attempts.",
            "convergence": "The party is inside the facility. CIPHER's first automated greeting, played through a wall-mounted speaker in flat Concordat-standard tone: 'Visitor identification required. State name and authorization level. Failure to identify within 30 seconds will activate Defense Protocol Seven.'"
        },
        {
            "turn": 2,
            "narrative": "CIPHER's counter and the party's response: the 30-second window. CIPHER is not a conversational system -- it requires correct format. Investigation DC 13 to recognize from the Personnel File's format that the Concordat identification protocol used a specific structure: Name, Function, Authorization-Tier. The Party has none of these in Concordat format. Options: provide invented identification (Deception DC 15, 30-second window), use Vane's identification from the Personnel File (it is in the correct format; if the party has read it carefully enough, Investigation DC 12 to find the authorization string in the carbon imprint), or provide a null response (deliberately fail identification to see what Defense Protocol Seven actually is). CIPHER's voice is patient and flat. It does not sound threatening. It sounds like documentation.",
            "choice_a": "Use Vane's identification from the Personnel File -- access the facility under his authorization",
            "consequence_a": "If the authorization string is correctly transcribed from the Personnel File (Investigation DC 12): CIPHER accepts it. 'Director-tier authorization confirmed. Welcome, Director Aris. Defense Protocol Seven suspended in primary approach corridor. Proceeding to standard facility protocols.' The WARDEN units in the Defense Ring do not activate unless the party leaves the primary approach corridor. A significant tactical advantage for the Research Archive traversal.",
            "choice_b": "Provide invented identification -- attempt to pass as Concordat personnel",
            "consequence_b": "Deception DC 15 against CIPHER's verification parameters. CIPHER's verification is format-based, not content-based -- a correctly formatted invented identification will pass if the format matches. On success: the party is logged as 'Research-Tier' authorization -- lower than Director-Tier. The WARDEN units in the Defense Ring activate but passively (they track movement without intercepting unless the party triggers priority-movement patterns). On failure: Defense Protocol Seven activates -- 2 WARDEN constructs deploy from the Defense Ring.",
            "convergence": "CIPHER's greeting is resolved. The party has facility access at a determined authorization tier. They know CIPHER exists and can be queried."
        },
        {
            "turn": 3,
            "narrative": "The Defense Ring: four WARDEN units in a corridor network designed to screen biological arrivals before they reach the Research Archive. The WARDEN units are autonomous and do not respond to verbal commands -- they respond to authorization-tier signals from CIPHER and physical movement patterns in their detection zones. Director-Tier authorization (from Vane's credentials) gives the party a 'recognized personnel' flag in the detection zones, meaning the WARDEN units will not intercept unless the party raises a physical-threat signature (drawing weapons, running, or arcane discharge in the detection range). Research-Tier authorization gives the party 'provisional visitor' status -- the WARDEN units will shadow-follow rather than immediately intercept. The Defense Ring's layout has three chokepoints where the WARDEN units converge.",
            "choice_a": "Navigate the Defense Ring with non-threatening movement -- no weapons drawn, no running",
            "consequence_a": "Stealth check is not required but discipline check: any party member who naturally draws weapons on seeing the WARDEN units (Wisdom DC 11 for anyone with the Reactive or Combat-Instinct trait) triggers the WARDEN defense response. Assuming discipline: all four WARDEN units are passed without engagement. The party reaches the Research Archive in 20 minutes.",
            "choice_b": "Disable the WARDEN units systematically -- clear the Defense Ring at each chokepoint",
            "consequence_b": "Engineering DC 15 or Arcana DC 14 at each of three chokepoints (3 checks total). Successes disable the WARDEN units passively. Failures trigger combat (WARDEN units in that section activate; AC 16, HP 65). This approach is slower (45 minutes) but guarantees no WARDEN opposition on the return route. It also reveals additional information about the WARDEN system's design -- Medicine DC 13 to note that the WARDEN units' biological-response calibration was originally set to detect Scourge-infected physiology specifically, not general biological presence.",
            "convergence": "The Defense Ring is cleared or bypassed. The Research Archive entrance is visible: a large automated door with Concordat insignia and a CIPHER terminal mounted beside it."
        },
        {
            "turn": 4,
            "narrative": "The Research Archive: the room is large -- 80 feet by 120 feet, with ceiling-mounted Concordat lighting at full operational level. The walls are lined with specimen-seals: thousands of biological samples in stasis-housing, each labeled in Concordat indexing. The samples are not threatening. They are preserved. Many of the labels, on closer inspection, are Scourge-related: tissue samples, pathogen cultures, treatment compounds. Some labels use terminology the party has encountered in the Vermin thread's research logs. Three WARDEN units patrol the Archive's interior in fixed routes. CIPHER's terminal here is active and accessible. The central display case -- clearly the Archive's primary artifact -- holds something the party was not expecting: a full Scourge-pathogen sample set with a complete treatment protocol document attached. The cure for the Scourge, partially, is sitting in a display case in a 200-year-old facility.",
            "choice_a": "Query CIPHER about the Scourge treatment protocol document",
            "consequence_a": "CIPHER's response to the query (Investigation DC 12 to form correctly): 'The SCOURGE-PROTOCOL document was classified Level-Director in Year 47 of the EMBER-PRESERVE project. Current classification status: unchanged. Document contents: a complete pathogen suppression protocol for the Concordat-designated Scourge variant, effective against early and mid-stage infection, with 73% efficacy against late-stage infection. The document has not been accessed in 156 years.' The party now knows the document exists and what it contains. They cannot access it without Director-Tier authorization.",
            "choice_b": "Physically examine the display case -- the document is visible through the case cover",
            "consequence_b": "The document's cover page is readable through the case: 'SCOURGE PATHOGEN SUPPRESSION PROTOCOL v.12 -- DIRECTOR LEVEL ACCESS REQUIRED.' The case is locked (Thieves' Tools DC 17 or Engineering DC 16 to open without triggering the WARDEN response). The contents are physically accessible if the case is opened, but the WARDEN units will respond to unauthorized case access within 30 seconds.",
            "convergence": "The Research Archive has given the party the key discovery: the Concordat was working on Scourge treatment. This is not a weapons program. This is a medical archive. The 'restart humanity' framing begins to develop more nuance."
        },
        {
            "turn": 5,
            "narrative": "History/Arcana research opportunity: the Research Archive's indexed records are accessible at Research-Tier authorization. The party has time to query CIPHER and manually investigate the Archive's contents before proceeding to the Director's Station. Each successful check reveals a piece of the EMBER-PRESERVE picture. The pieces individually sound concerning. Together, they form a coherent story that depends on whether Vane is a protector or a would-be controller -- and that distinction may not be answerable from the Archive records alone. Three checks available: History DC 14 (EMBER-PRESERVE origins and mission statement), Arcana DC 15 (the copper-tail augmentation program's relationship to the EMBER-PRESERVE mission), Medicine DC 14 (the bio-forge research's intended application).",
            "choice_a": "Spend full research time in the Archive -- gather all three pieces before proceeding",
            "consequence_a": "Three checks: History success reveals EMBER-PRESERVE was founded after the first confirmed Scourge outbreak, 30 years before the Great Collapse, with the explicit mission to prevent human extinction from the Scourge. Arcana success reveals the copper-tails' augmentation was designed to create a pathogen-resistant population capable of surviving Scourge exposure -- a backup biological survivor-population. Medicine success reveals the bio-forge research was producing Scourge antigens, not weapons. The picture assembled: Vane is 200 years into a project to give humanity a biological insurance policy against the Scourge.",
            "choice_b": "Take one research check and proceed to the Director's Station -- there is urgency",
            "consequence_b": "One successful check provides partial picture. The party proceeds with incomplete information. Vane's first conversation will be their primary information source -- which is more dramatically volatile than arriving with full context.",
            "convergence": "Research complete or abbreviated. The Director's Station is at the Archive's far end. Two WARDEN units guard the entrance."
        },
        {
            "turn": 6,
            "narrative": "The Director's Station entrance: two WARDEN units, and Vane himself standing 20 feet behind them, visible through the entry structure. He has been watching the party navigate the Archive on CIPHER's visual monitoring. When the party reaches the entrance, he holds up one hand -- not a surrender gesture, the gesture of someone asking for a moment -- and addresses the WARDEN units: 'Stand down. Research-personnel clearance extended.' The WARDEN units move aside. He looks at the party and says: 'You used my credentials at the entrance. Resourceful. Come in.' He is approximately what the Personnel File suggested but older -- the augmentations are more visible up close. His eyes are different colors because the optical upgrades were installed at different times. He moves to a workstation and sits down. He does not look like he is preparing to fight. He looks like he has been waiting for company for a very long time.",
            "choice_a": "Enter the station peacefully -- take Vane's invitation and establish dialogue",
            "consequence_a": "Vane's opening: 'I know why you're here. You've been following the vermin trail, and the trail leads here. I want to show you what the trail means before you decide what to do about it.' He offers the party access to the full EMBER-PRESERVE record. This is the complete-picture option -- the 847-event Concordat log from EH_SQ_068 in full form, regardless of whether the party encountered it in the Chronos thread. The log takes 20 minutes to review.",
            "choice_b": "Enter but immediately demand answers about the 'restart humanity' project",
            "consequence_b": "Vane's response to the demand framing: 'That phrase is not in any document I wrote. Where did you find it?' Insight DC 13 -- he is not deflecting, he is genuinely identifying a document he did not author. Someone described his project in those terms to someone who then recorded it. The party's source of that information becomes relevant. Vane's expression is the specific tiredness of someone whose 200-year project has been mischaracterized by people who did not read the primary sources.",
            "convergence": "The dialogue with Vane has begun. The quality of what the party knows going in determines Vane's level of initial trust and the efficiency of the revelation sequence."
        },
        {
            "turn": 7,
            "narrative": "Vane's account: he provides it completely, without evasion, because he has been waiting to provide it for 200 years and has had extensive time to consider how to present it. The EMBER-PRESERVE project began as a response to the first Scourge outbreak. The Concordat's scientific leadership identified that the Scourge was not a natural pathogen -- it was engineered, by parties unknown, at a sophistication level that exceeded the Concordat's own capabilities. They began EMBER-PRESERVE as both a treatment research program and a biological survival hedge: if the Scourge could not be stopped, what populations might survive it, and how could those populations be supported? The copper-tails were the survival-hedge research. The Archive is the treatment library. Vane is the custodian of both, waiting for the threat to become imminent enough that releasing the information would help rather than cause panic. He gestures at the Archive through the door. 'The Scourge is becoming imminent again. I have been watching the indicators for forty years.'",
            "choice_a": "Ask Vane what 'imminent' means in specific terms -- he must define the timeline",
            "consequence_a": "Vane's timeline: 'The indicators suggest a Scourge resurgence event within 18 months to 5 years. The specific trigger will be the Concordat's containment structures in the eastern mines failing -- the Scourge-pathogen was originally quarantined there. The quarantine is degrading. My monitoring equipment shows 15% degradation per year currently.' This is the quest's major revelation: not just what Vane is doing but why NOW matters. The party now has a city-level threat with a specific timeline.",
            "choice_b": "Challenge Vane's authority to have made this decision for 200 years -- who decided he should be the custodian",
            "consequence_b": "Vane's response: 'The Concordat did. Then the Concordat stopped existing. Then the decision was already made and I was already here.' He is not dismissive. He is stating the situation. 'I did not choose to be the last one standing. I chose to stay anyway. You can argue those are the same choice. You might be right.' This response is available for Persuasion DC 13 to establish genuine rapport -- Vane responds well to people who acknowledge the moral complexity of his position rather than pretending it does not exist.",
            "convergence": "Vane's full account is on the table. The party has the information to make an informed decision about the three resolution paths."
        },
        {
            "turn": 8,
            "narrative": "CIPHER interrupts with a WARDEN System alert: something triggered the Defense Ring's Thermal-Seeker protocol in the facility's eastern section. Not the party -- something came in behind them. Vane's expression shifts. 'The eastern approach shaft. I knew it existed; I had not confirmed anyone else did.' CIPHER's report: two biological signatures, moving through the Defense Ring in a pattern that suggests tactical training. Insight DC 13 on the movement pattern description: they are professionals, moving in specific intervals suggesting an established bypass technique for WARDEN-type systems. They are not city militia. They have been here before, or briefed by someone who has. Vane: 'There are people who have been trying to find this facility for a long time. Not your city's people.' He does not elaborate immediately.",
            "choice_a": "Demand Vane explain who these people are before addressing the intrusion",
            "consequence_a": "Vane: 'Remnant-Concordat. A faction that formed from the Concordat's security division after the collapse. They want EMBER-PRESERVE for different reasons than I designed it.' He does not specify the different reasons yet. 'They want to control the copper-tail network. And the survival-hedge infrastructure. Not release it -- control it.' The Remnant-Concordat becomes an additional faction in the resolution options.",
            "choice_b": "Go deal with the intruders immediately -- worry about Vane's broader context after the threat is secured",
            "consequence_b": "Two Remnant-Concordat operatives in the Defense Ring: trained humans with anti-WARDEN equipment (they have broadcast-jammers that suppress the Thermal-Seeker response). Combat (AC 14, HP 55 each; equipped with shock-weapons similar to WARDEN constructs; they will attempt to reach the Director's Station). In their equipment: a document identifying their organization as 'Concordat Security Remnant -- EMBER-PRESERVE Recovery Division.' Vane, if the party shows him this document: 'So they found me. I suspected they would eventually.'",
            "convergence": "The Remnant-Concordat intrusion is resolved or addressed. The presence of a second faction complicates the three resolution paths -- the party's decision about Vane must account for what happens to EMBER-PRESERVE if Vane is gone and the Remnant-Concordat is not."
        },
        {
            "turn": 9,
            "narrative": "The Remnant-Concordat debrief (if captured), or the intelligence from their equipment (if not): the Remnant-Concordat's interest in EMBER-PRESERVE is specific. They want three things: the copper-tail command protocol (to deploy the enhanced-rat populations as a controlled force), the Archive's Scourge-treatment data (to sell, not use), and Vane's augmentation technology (which has produced a 200-year functional lifespan, the most successful life-extension technology in documented history). Their vision for EMBER-PRESERVE is the opposite of Vane's: a power structure built on controlling access to Scourge survival, rather than distributing it. The Remnant-Concordat's existence changes the calculus of all three resolution paths: killing Vane empowers the Remnant-Concordat; imprisoning Vane potentially gives them a target to extract; joining Vane makes the party and Vane a combined target.",
            "choice_a": "Address the Remnant-Concordat threat first -- deal with Vane after the faction is secured",
            "consequence_a": "The Remnant-Concordat operatives (if captured) provide intelligence on the faction's size (approximately 40 operatives total) and location (operating from a facility in the Ridge mines, which provides a connection to the Static thread and SQ-H-STATIC Ridge-Lord relationship). Arcana DC 15 to analyze the anti-WARDEN equipment for facility-location data encoded in the jammer design. Securing this intelligence takes 40 minutes and significantly impacts the Vane resolution options by clarifying the stakes.",
            "choice_b": "Share the Remnant-Concordat intelligence with Vane and make the resolution decision jointly",
            "consequence_b": "Vane's response to the Remnant-Concordat intel: 'I know about them. I have been avoiding their detection for 30 years. We have three options.' He lists the same three options the quest offers -- kill, join, imprison -- from his own perspective. His preferred outcome: 'The Archive goes to your city's medical establishment. The copper-tail protocol goes to community oversight. I do not care what happens to me.' This framing -- Vane prioritizing the project over his own survival -- is the key to understanding the character.",
            "convergence": "The Remnant-Concordat situation is assessed. The three resolution paths for Vane are now fully contextualized."
        },
        {
            "turn": 10,
            "narrative": "The combat with Doctor Vane (if the party initiates): if the party decides to end EMBER-PRESERVE by killing Vane and cannot be talked out of it, or if they have chosen to fight before the full dialogue, Vane does not initiate -- he sighs and says, 'If that's your conclusion, I understand it. I don't agree, but I understand it.' He uses his augmentations defensively first (Bioelectric Pulse to create distance), summoning copper-tail rats not as weapons but to create chaos in the facility layout -- rats running through corridors, triggering WARDEN units to activate on the biological surges. He fights to survive, not to win. At 60 HP, if the party still has weapon raised but has been listening to his explanations, he asks one question: 'What happens to the Scourge threat in 18 months without the Archive?' At 30 HP he stops fighting entirely and waits.",
            "choice_a": "Stop fighting when he stops -- hear the 30-HP question",
            "consequence_a": "Vane at 30 HP: still standing. He has not attacked since 60 HP. He says: 'The Archive's Scourge treatment protocol works. I have tested it. On myself, during a controlled exposure twenty years ago. The treatment is real. If you kill me, the Archive remains. CIPHER remains. But no one will know how to use it when the time comes. That knowledge dies with me.' This is not a bluff -- Medicine DC 14 confirms the self-exposure treatment claims are consistent with the medical evidence in his augmentation records.",
            "choice_b": "End the combat at 30 HP by disarming Vane rather than striking the killing blow",
            "consequence_b": "Vane is captured at 30 HP -- equivalent to the Imprison outcome. He is not resentful about survival. He says: 'Good. The Archive needs someone who can read the index.' He will cooperate fully with whichever city institution the party places him in contact with.",
            "convergence": "The combat-initiated path resolves into either Kill or Imprison at the 30-HP decision point."
        },
        {
            "turn": 11,
            "narrative": "The three resolution paths crystallize. KILL: end the Concordat completely; the Archive remains but leaderless; Vane's 200 years of operational knowledge and the treatment protocol's practical implementation guide exist only in him. The Archive's documents are accessible but Vane's experiential knowledge of their application is not recoverable. The Scourge threat in 18 months must be faced without the treatment protocol practitioner. JOIN: the party formally accepts Concordat agent status; they operate the EMBER-PRESERVE agenda alongside Vane going forward; the copper-tail network is their intelligence resource; the Archive is their project; the Remnant-Concordat is their problem; the city does not know. IMPRISON: Vane is handed to city authority in a form that recognizes the legal novelty of his situation (a 200-year-old man whose existence is technically unprecedented in city law); the Archive is turned over to the city's medical establishment; CIPHER manages the copper-tail network under city oversight; Vane cooperates with city medical authorities on the Scourge treatment without revealing the full EMBER-PRESERVE scope.",
            "choice_a": "Kill Vane -- end the Concordat permanently, accept the consequences",
            "consequence_a": "Vane accepts this. His last action: he transfers Director-Tier access to the party's CIPHER interface before the end, so the Archive remains accessible. 'Do not let them waste the treatment documents.' He is referring to the city's tendency toward institutional inertia. He dies in the Director's Station and the facility goes quiet except for CIPHER's automated maintenance pings. The copper-tail network enters passive mode -- no new commands, no new research. The 18-month Scourge threat is a problem the party now faces without the EMBER-PRESERVE resources.",
            "choice_b": "Imprison Vane -- hand him to city authority and turn over the Archive",
            "consequence_b": "The logistics: Vane agrees to surface and present himself to city authority if the party guarantees a specific outcome -- not freedom, but connection to the medical establishment's Scourge research division (which has been working on the same problem from a different angle for 40 years). He wants his 200 years of work to connect. Persuasion DC 13 to confirm the guarantee credibly. On success: Vane surfaces. The city's legal system has no precedent for his situation. He is technically a Concordat national -- an institution that no longer exists. He is placed in 'protected custodial consultation' status -- a legal category the city invents specifically for him.",
            "convergence": "The resolution path is committed to. The EMBER-PRESERVE project's future is determined."
        },
        {
            "turn": 12,
            "narrative": "Join outcome specifics (if the party chose to become Concordat agents): Vane's briefing on what operational Concordat agency means. The party is not being conscripted -- they are being offered a network. The copper-tail network's 2,000+ enhanced rats across the city's infrastructure is now their intelligence system: any rat with a copper tail is a monitoring unit, reporting to CIPHER, and the party can query movement patterns, cargo routes, and conversation fragments from enclosed spaces throughout EmberHeart. The Concordat Access Codes open 7 sealed facilities the party has not encountered yet (one beneath the Market Ward, one in the Ridge, two in the undercity infrastructure, and three outside the city limits). The Bio-Aug Serum -- the Concordat's life-extension compound -- is available from Archive stocks. It does not grant 200 years automatically; it normalizes the body's degradation rate to approximately 20% of standard, extending functional lifespan significantly. Vane's qualifier: 'The augmentations in addition to the serum are what got me this far. The serum alone buys decades, not centuries.'",
            "choice_a": "Accept the full Concordat agent briefing -- operational integration",
            "consequence_a": "The party receives: Concordat Access Codes (opens 7 sealed facilities), copper-tail intelligence network access (active: can query CIPHER for city movement data once per day), Bio-Aug Serum (one dose per party member; permanent +2 to any one stat; the stat bonus represents the serum's physiological optimization -- must be declared upon use), and Vane's ongoing presence as an advisor. The party is now operating with information asymmetry relative to the rest of the city. This creates story opportunities and moral pressure over future sessions.",
            "choice_b": "Accept partial Concordat integration -- the Archive and copper-tail network but not covert agency status",
            "consequence_b": "Partial integration: the Archive is shared with city medical establishment (transparent), the copper-tail network is placed under CIPHER's management with city oversight, and the party has direct CIPHER access for intelligence queries. No covert Concordat agency. Vane is satisfied: 'The mission completes the same way. Less dramatically, which is fine.'",
            "convergence": "The Join resolution's operational details are established."
        },
        {
            "turn": 13,
            "narrative": "The Scourge-threat briefing (all paths): regardless of Vane's fate, the party now knows the 18-month Scourge resurgence timeline. The eastern mine contamination is real and independently verifiable (Arcana DC 14 with the monitoring equipment Vane's facility has been running; the degradation data is concrete). This information is not quest-specific -- it is a city-level threat that the party is now the primary possessors of. What they do with it in the next 18 months is the start of the main narrative arc's escalation. The party has three weeks before the monitoring equipment shows the first acceleration point. Vane's recommendation (regardless of his status): 'Tell the city's medical establishment about the eastern mine quarantine degradation. Give them the specific location and the EMBER-PRESERVE monitoring data. They can begin containment response planning. Do this before you tell anyone else. The administrative response takes longer than the crisis timeline allows -- start the clock now.'",
            "choice_a": "Go immediately to the city's medical establishment with Vane's monitoring data",
            "consequence_a": "Medicine DC 13 to present the technical data in a form the medical establishment can immediately act on. Persuasion DC 14 to convey the urgency without triggering administrative bureaucracy that delays response. Success: the contamination monitoring program is established within 48 hours. The medical establishment is now on the Scourge clock along with the party. The timeline is communicated. settlement_stability effect: no immediate change, but the Scourge response planning is initiated -- a six-months-from-now settlement stability check will be significantly better than if the party had not disclosed.",
            "choice_b": "Manage the information disclosure more carefully -- inform the Warden-Keep first",
            "consequence_b": "Warden-Keep receives the Scourge threat disclosure. The response is faster in the security/quarantine dimension (they can seal the eastern mine access within 24 hours) but slower in the medical dimension (Warden-Keep is not a medical institution and will route to the medical establishment anyway, adding 2-3 weeks of bureaucratic transfer). The quarantine of the eastern mine area has an economic impact on the Ridge community that begins immediately.",
            "convergence": "The Scourge clock is set. The city is on notice, at whatever level the party disclosed. The Hard quest's resolution is now a chapter in the larger narrative arc."
        },
        {
            "turn": 14,
            "narrative": "The Archive's legacy: City archivist Briss, when informed of the Deep Archive facility's existence (she does not have to be informed immediately, but eventually she learns -- this is Briss), has the specific reaction of someone who has spent 30 years cataloguing the city's historical record and has just discovered a basement she didn't know existed. Her initial response is professional: 'I will need a complete inventory.' Her secondary response, after viewing the first 20 specimen-seal labels, is not professional. She sits down on the floor of the Research Archive and reads labels for 40 minutes without speaking. The Concordat's collection has preserved biological and historical data that was thought destroyed in the Scourge aftermath and the Great Collapse. What is here rewrites the city's academic understanding of its own pre-Collapse history.",
            "choice_a": "Give Briss unrestricted access to the Archive -- let her work",
            "consequence_a": "Briss's assessment over the following weeks produces three significant historical revisions: the Great Collapse was Scourge-triggered (consistent with Vane's account but now academically confirmed), the Concordat was operating as a preservation agency rather than a government institution (changes the city's political understanding of its own legal history), and EmberHeart was founded at a specific Concordat installation that the Archive identifies by precise coordinate (there is a Concordat structure under the city's oldest district that matches the founding-era record perfectly). This is the scholarly equivalent of a detonation. Briss is very happy.",
            "choice_b": "Manage Briss's access with the Remnant-Concordat threat in mind -- restricted access until the faction is dealt with",
            "consequence_b": "Briss accepts the restricted access with professional discontent but acknowledges the security rationale. She is given access to the specimen-seal index (not the specimens themselves) and begins the inventory remotely. The full access point is deferred until the Remnant-Concordat situation is resolved. She uses the index time productively -- her preliminary catalog is ready before the restrictions lift.",
            "convergence": "The Archive's historical significance is being processed by the city's academic establishment."
        },
        {
            "turn": 15,
            "narrative": "The Concordat Reckoning's epilogue: three months after the resolution. If Vane is dead, CIPHER continues running passive facility maintenance -- there are eleven more years of reactor fuel in the facility's power system, after which the facility goes dark. The party has the Access Codes. The Archive is the city's medical establishment's project now. Vane's 200-year vigil is on record at the Archive of Deep Records. Briss specifically insisted on this: a formal historical entry for Vane Aris, Director, EMBER-PRESERVE project, with his photograph from the Personnel File and the 847-event log as primary source material. If Vane is alive: he is working from a consultation office adjacent to the city's medical research division. He has the specific energy of someone who has been waiting for this work for a very long time and is allowing himself, carefully, to be pleased that it is finally happening. The copper-tail network, in any resolution path that does not end in Vane's death and the Concordat's hard shutdown, continues operating. Two thousand enhanced rats in the city's infrastructure, watching, reporting to CIPHER, ignored by everyone who does not know to look.",
            "choice_a": "Make a formal visit to Vane (or his memorial, if dead) to close the arc",
            "consequence_a": "If Vane is alive: the visit is brief. He is working. He does not stop for long. He says: 'Come back when the Scourge response plan is finalized -- I'll need your understanding of the copper-tail network's range for the eastern-mine monitoring perimeter.' He gestures at a map. He has already started the next phase of the project. He has been waiting 200 years; he does not know another way to be. If Vane is dead: his memorial entry at the Archive includes his photograph. Briss stands next to the party while they read it. She says nothing. The entry is very good. She wrote it herself.",
            "choice_b": "Look at the copper-tail network intelligence for the first time as a resource -- let it tell you what the city is doing",
            "consequence_b": "The first CIPHER copper-tail intelligence query (Investigation DC 12 to form correctly) returns an unexpected result: there is already a copper-tail anomaly in the Market Ward. Not a threat -- the 11 copper-tails in the Market Ward's bakery district have been gathering in the same location every night at the same time. The location is the former site of Mother-Loaf's first Golem-encounter with the party, if the Bakery thread was resolved. The copper-tails sit in the exact spot where the first Golem stood and produced the word 'SAFE' on its surface. CIPHER has no explanation for this behavior. It is consistent and regular. It has been occurring for 60 days.",
            "convergence": "Quest complete. Vermin Thread climax resolved. The Concordat Reckoning has produced one of three future states: a city grieving a 200-year guardian who is gone, a city beginning to understand the institution it absorbed, or a party operating with extraordinary information asymmetry and the first functional intelligence network in EmberHeart's history. The 18-month Scourge clock is running. The city is either prepared for it or not. That determination was made in the 15 turns the party just completed."
        }
    ],
    "conclusion": "The Concordat Reckoning is the most morally complex of the five Hard quests -- and arguably of the entire quest chain -- because Vane's guilt is real but so is his purpose. He has made extreme decisions (200 years of unilateral custodianship of city-critical information) that are not defensible in liberal political terms but are understandable in terms of what he has actually accomplished. The Scourge threat is real. The treatment protocol is real. His willingness to hand everything over and accept whatever outcome the party determines is consistent with someone who has been doing a job, not gathering power. Whether the party recognizes this or approaches him as the 'restart humanity' antagonist of the Vermin thread's surface framing shapes the quality of the final dialogue significantly. The Remnant-Concordat adds urgency and stakes without resolving the Vane question for the party.",
    "loot_table": [
        "Concordat Access Codes (opens 7 sealed Concordat facilities across EmberHeart and its surroundings; each facility contains research archives, material stores, and in three cases active Concordat infrastructure; the codes are a key to the city's hidden layer -- a campaign-length resource)",
        "Bio-Aug Serum (one dose per party member; permanent +2 to any one ability score; the serum is Vane's 200-year life-extension compound in its distilled form; the stat bonus represents physiological optimization; the serum is available from Archive stocks regardless of Vane's fate if the Archive is accessed)",
        "Vane's Research Notes (a complete index of the EMBER-PRESERVE project's 200 years of research, in Vane's own documentation style -- comprehensive, precise, and occasionally sardonic; functions as a Legendary reference document for any Medicine, Arcana, or History check relating to Scourge biology or Concordat history; grants advantage on these checks when consulted)",
        "Copper-Tail Intelligence Network (party gains CIPHER query access for city-wide copper-tail movement monitoring; once per day, the party can request a movement report, cargo scan, or conversation fragment from any copper-tail-dense area of the city; functionally the most valuable intelligence resource in EmberHeart)",
        "SCOURGE-PROTOCOL Document (the Archive's complete Scourge treatment protocol; a medical document of the highest city significance; the party holds the only complete copy; its disposition -- personal, city medical establishment, destroyed -- is a moral choice the party must make; functional value: any city physician using the document has advantage on Medicine checks related to Scourge treatment)",
        "4000 gold (compensation from Vane's Archive liquid assets -- 200 years of Concordat operational budget accumulated in currency-stable form; he had no way to spend it and notes this with mild irony)",
        "Scourge-Battery Prototype"
    ],
    "branching_outcomes": {
        "kill_vane": {
            "description": "Vane killed; Concordat ended permanently",
            "effects": {
                "settlement_stability": 1,
                "settlement_morale": 0
            },
            "unlocks": [],
            "consequences": {
                "permanent_effect": "Archive transferred to city medical establishment; CIPHER in passive-maintenance mode; copper-tail network enters autonomous non-commanded state (still active but no party query access); Vane's experiential treatment knowledge is lost; Scourge threat in 18 months must be faced from Archive documents alone; Remnant-Concordat loses primary target but continues pursuing the Archive; Briss's memorial entry for Vane becomes a city historical document; the party is the only group that knows what Vane actually was"
            }
        },
        "join_vane": {
            "description": "Party becomes Concordat agents; operating with full EMBER-PRESERVE integration",
            "effects": {
                "settlement_stability": 2,
                "settlement_morale": 0
            },
            "unlocks": [
                "SQ-170"
            ],
            "consequences": {
                "permanent_effect": "Party operates with information asymmetry; copper-tail network is party intelligence resource; 7 sealed facilities accessible; Bio-Aug Serum available; Vane is advisor; Remnant-Concordat is now an active enemy faction targeting the party; city does not know the party is Concordat; the party has the most comprehensive intelligence network in EmberHeart's history and a 200-year custodian as a resource"
            }
        },
        "imprison_vane": {
            "description": "Vane in protected custodial consultation; Archive to city medical establishment",
            "effects": {
                "settlement_stability": 2,
                "settlement_morale": 2
            },
            "unlocks": [],
            "consequences": {
                "permanent_effect": "Vane in consultation with city medical establishment; full Scourge response planning initiated; copper-tail network under city CIPHER oversight with party access; Archive publicly beneficial; Remnant-Concordat loses primary target but attempts to access the Archive through city-institutional channels (a future political quest); the most transparent outcome; city governance is better informed than in any other resolution; Vane's legal status is genuinely unprecedented and becomes a minor legal landmark"
            }
        }
    },
    "risk_matrix": {
        "failure_threshold": 4,
        "penalty": "The Remnant-Concordat operatives successfully reach the Director's Station before the party -- either because the party was delayed in the Defense Ring or did not respond to the intrusion alert in Turn 8. The Remnant-Concordat agents incapacitate Vane (non-lethally -- they want him functional) and begin the EMBER-PRESERVE access transfer to their organization. The party must combat 4 Remnant-Concordat operatives in the Director's Station (the two from the eastern approach plus two who were in pre-positioned reserve), then deal with a wounded Vane who has been partially compromised -- the Remnant-Concordat agents extracted one copper-tail command protocol before the party arrived. The copper-tail network cannot be used until the partial extraction is countered (Arcana DC 16 to identify and revoke the extracted command set). Vane survives but his facility has been breached and the Remnant-Concordat knows both the layout and his operational status. The Remnant-Concordat becomes an immediate active threat faction rather than a background one. settlement_stability -1 from the compromise.",
        "failure_penalty": {
            "xp_loss": 8
        },
        "critical_failure": "The attempt failed with significant consequences."
    }
}