{
    "version": "1.0",
    "npcs": [
        {
            "id": "EH-01",
            "name": "Marta Hale",
            "race": "Human",
            "role": "Council Speaker",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473551613615411313/image0.jpg?ex=699899a1&is=69974821&hm=9fdb80453851527056741b7430d53338eb3ac8b8b4f9b486edb446c4ef849a42&",
            "description": "A weathered human woman in her late 50s. She wears heavy, textured council robes of midnight-blue velvet trimmed with singed silver thread. Her salt-and-pepper hair is pulled into a severe, tight bun. Her face is a map of leadership stress—deep character lines and weary, sharp gray eyes that catch the flickering indigo glow of a Warden-Lens. She carries a gavel made from a petrified mountain root.",
            "bio": "Marta Hale wasn't born to rule; she was born to mediate. A former diplomat from the surface-tribes, she led the first wave of refugees into EmberHeart. She is the political glue holding the fractious council together. She believes that the survival of the species outweighs any individual morality—a belief that was tested and broken during the sealing of Line 4.",
            "motivation": "Maintaining civil order at any cost while the 'Weaver' scratches at the edges of their reality.",
            "influence": 10,
            "loyalty": 75,
            "fear": 22,
            "secret": "Line 4 wasn't sealed for safety; it was sacrificed to contain the 'Weaver'.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-02",
            "name": "Borin Ashmantle",
            "race": "Dwarf",
            "role": "Master Miner (Council)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473555423859576873/image0.jpg?ex=69989d2e&is=69974bae&hm=a9efaff00a63ae04ed11da0fe578a5d685737cb7d46eb75a163bb5aebdfcc80d&",
            "description": "A stout Dwarf with a broad, powerful frame. His magnificent beard is white and singed, held together by iron bands. He wears heavy, oil-stained mining leathers and a belt laden with pneumatic tools. He carries a primitive frequency-lantern that casts a rhythmic, orange-and-blue pulse. His hands are massive and soot-stained, permanently gripping a heavy, arcanotech pickaxe.",
            "bio": "Borin is a master of 'Deep-Listening'—the art of finding ore through the vibrations of the mountain. He lost three brothers to the first collapse and has since become obsessed with structural stability. He is gruff and pragmatic, often clashing with the more idealistic council members.",
            "motivation": "Digging deep enough to find the geothermal heart of the mountain before the vibrations go silent.",
            "influence": 9,
            "loyalty": 62,
            "fear": 35,
            "secret": "Heard breathing deep in Shaft 3.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-03",
            "name": "Lysa Fen",
            "race": "Human",
            "role": "Shrine-Keeper (Council)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474265636820619314/image0.jpg?ex=6999385e&is=6997e6de&hm=83726e44ead712eda8b83f0ca5a5debe31f07435b406723cdc28025b4a4e013b&",
            "description": "A woman of ageless grace, standing amidst incense smoke. She wears flowing, translucent robes of white silk embroidered with gold geometric patterns. Her long, dark hair is decorated with small, humming crystals. Her eyes have a faint, luminescent violet tint that glows when she speaks of the mountain. She holds a copper bowl containing a single, floating ember.",
            "bio": "Lysa has always felt the 'hum' of the World-Spark. She isn't a priestess of a god, but a servant of the mountain's logic. She provides spiritual and psychological comfort to the refugees, though many find her unsettlingly detached from mundane concerns.",
            "motivation": "Ensuring the psychological stability of the populace through 'Correct Alignment' with the Spark.",
            "influence": 9,
            "loyalty": 58,
            "fear": 28,
            "secret": "Nightmares of fire beneath the earth.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-04",
            "name": "Garric Thorn",
            "race": "Human",
            "role": "Militia Captain (Council)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473556763923189788/image0.jpg?ex=69989e6d&is=69974ced&hm=865fa5564748f61bc4f0d68ab3318415d0d4cb4111c22649330b9cb90d3005fd&",
            "description": "A tall, broad-shouldered man in dented, soot-blackened militia plate armor. He wears a heavy, fur-lined cloak that smells of cold and smoke. His hair is cropped short and military-style, and a deep, jagged scar runs from his left ear to his chin. His jaw is locked in a permanent scowl, and his hand constantly rests on the pommel of a battered broadsword.",
            "bio": "Garric was once a knight of high standing in a kingdom that no longer exists—one that fell because its leaders were too soft. He took the remnants of his garrison to EmberHeart to ensure the same mistake wouldn't happen again. He is often the 'bad cop' of the council, pushing for stricter security and harsher rationing.",
            "motivation": "Redemption through absolute security; preventing the fall of the last bastion.",
            "influence": 9,
            "loyalty": 60,
            "fear": 22,
            "secret": "Abandoned by former kingdom.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-05",
            "name": "Elric Vann",
            "race": "Human",
            "role": "Smith Rep (Council)",
            "description": "A lanky man with strong, wiry arms and charcoal-stained skin. He wears a singed leather apron over simple linen shirts. His face is long and intense, with deep-set eyes that seem to analyze the internal structure of every object he sees. He carries a small, precision-calibrated hammer on his hip. Tiny sparks occasionally dance in his messy, soot-covered hair.",
            "bio": "A prodigy of the Warden-Forge, Elric represents the interests of the smiths and casters. He believes that the future of EmberHeart lies in 'Frequency-Casting'—the blending of traditional smithing with the World-Spark's energy. He is younger than most of the council and often impatient with their political games.",
            "motivation": "Perfecting the arcanotech casting process to create unbreakable shields.",
            "influence": 8,
            "loyalty": 57,
            "fear": 20,
            "secret": "Found strange metal vein below.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false,
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474253741715624018/image0.jpg?ex=69992d4a&is=6997dbca&hm=e887836669b39e188c8c854c903605f5adad41bbafca924dad273b068a253e7d&"
        },
        {
            "id": "EH-06",
            "name": "Toma Redbrook",
            "race": "Human",
            "role": "Miner",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474254296798462095/image0.jpg?ex=69992dce&is=6997dc4e&hm=76b1ffe357bfc5e7ead02132677a2158c0d82c1d031a4f2e2f897a53e2732eed&",
            "description": "A barrel-chested human man in his early 30s. He is covered head-to-toe in a fine layer of red-tinted iron dust. He wears tattered, heavy-duty mining overalls over a singed canvas shirt. His eyes are wide and bloodshot, set in a face permanently smudged with soot. He grips a battery-powered pneumatic drill that leaks a faint blue vapor. He stands with a slight tremor in his hands.",
            "bio": "Toma was one of the first miners to be assigned to the lower shafts after the World-Spark resonance began. He is a hard worker but has become notoriously superstitious, often refusing to enter any tunnel that doesn't have a 'blessed' frequency-lamp. He speaks in a low, raspy whisper.",
            "motivation": "Doing just enough work to earn his rations without being sent back into 'The Deep'.",
            "influence": 2,
            "loyalty": 52,
            "fear": 35,
            "secret": "Refuses lower tunnels.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-07",
            "name": "Hal Bren",
            "race": "Human",
            "role": "Miner",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474254844079378462/image0.jpg?ex=69992e51&is=6997dcd1&hm=2b8a7ce9293035845ae89dd98de1f2e1f9d45201d057143b541ec0ded26ca2cd&",
            "description": "A scrawny, hollow-cheeked man with a permanent nervous twitch. He wears an oversized, oil-stained tool-belt and a tattered, greasy cap. His skin is pale and sallow, except for the dark circles under his sunken eyes. He carries a small, flickering arcanotech lantern tethered to his wrist by a rusty chain. He frequently bites his nails and looks over his shoulder as if expecting a debt collector.",
            "bio": "Hal is a man who made some very poor choices in the gamblers' dens of the upper colony. He works double-shifts in the mines to pay off his debts to some of the more unsavory elements of the militia. He is constantly looking for 'the big find' that will buy his freedom, though most of his colleagues think he's just digging his own grave.",
            "motivation": "Accumulating enough 'Frequency Chunks' to buy his way out of a broken jaw.",
            "influence": 1,
            "loyalty": 47,
            "fear": 22,
            "secret": "Gambling debt.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-49",
            "name": "Haldor Iron-Hand",
            "role": "Master Smith / Warden-Caster",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473555756203905161/image0.jpg?ex=69989d7d&is=69974bfd&hm=3cfdb02503ae697585a2944bd4e11a6dcd75e0b2a4c48af8ee8e6aa679dc768e&",
            "description": "A massive, muscular man with skin the color of hammered bronze and eyes like molten gold. His left arm is a masterfully crafted iron prosthetic from the elbow down, intricate with copper wiring and small blue World-Spark capacitors. He wears a heavy, singed leather apron over his bare chest, which is etched with smithing-clan tattoos. He holds a massive forging hammer that hums with a low, deep frequency.",
            "bio": "A veteran of the Old Deep, Haldor was one of the first to pledge his hammer to King Kaelrath. He lost his left hand to a crawler, replacing it with a self-forged iron gauntlet that he continuously upgrades. He is the technical heart of the Warden Forge, responsible for the creation of the most advanced arcanotech armor.",
            "motivation": "To see Emberheart's forge fires burning brighter than the Spires' suns, proving the superiority of Warden-craft.",
            "loyalty": "Total (Devoted to the Smith-King)",
            "stats": {
                "str": 18,
                "smithing": "+7",
                "con": 16
            },
            "connection": "Kaelrath's primary technical lead in the Warden Forge."
        },
        {
            "id": "EH-50",
            "name": "Vorenus of the Gilded Coast",
            "role": "Trade Basin Merchant Prince",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473555987217780797/image0.jpg?ex=69989db4&is=69974c34&hm=44e90b6169fed907e81cc34a83fe0875ee36b6daeee9c0d032e48d5980242390&",
            "description": "A flamboyant human man in his early 40s. He wears multi-layered, shimmering silks of emerald and gold, held together by chains of heavy, polished brass and intricate amulets of frequency-glass. He has a perfectly manicured beard and wears a single, oversized ruby on his thumb. He holds a tall, glass-topped cane containing a miniature, swirling storm-cloud.",
            "bio": "A power-player in the Western Trade Basin who despises the Spires' monopoly on high-grade ore. He values profit above loyalty but hates being extorted. He sees EmberHeart as a high-risk, high-reward investment that could either make him the master of the valley or end his life in a Spire dungeon.",
            "motivation": "To break the Spires' economic stranglehold on the valley and secure a monopoly on Warden-Tech.",
            "loyalty": "Neutral-Opportunistic",
            "stats": {
                "cha": 18,
                "insight": "+6",
                "persuasion": "+8"
            },
            "connection": "Responded to Silvy's broadcast; potential ally or dangerous debtor."
        },
        {
            "id": "EH-08",
            "name": "Mira Kest",
            "race": "Human",
            "role": "Miner",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474255101953703968/image0.jpg?ex=69992e8e&is=6997dd0e&hm=712d98f37ec03209e0bf4ee48082da5445328089f489a7bc383311dc4c4ee028&",
            "description": "A sturdy woman with muscular arms and a face like weathered stone. Her hair is cut into a practical, jagged bob and is always dusted with grey limestone powder. She wears heavy, reinforced boots and a thick leather apron that is stained with thermal-fluid. Her eyes are sharp and suspicious. She carries a heavy sledgehammer and a cluster of arcanotech sensors that pulse with a faint, rhythmic green light.",
            "bio": "Mira is known for her 'Heat-Sense'—an ability to feel the temperature-shifts in the stone before steam-vents rupture. She is a survivor of three major collapses and has little patience for the inexperienced. She often works alone in the outlier shafts, claiming she 'prefers the silence of the earth to the chatter of the council'.",
            "motivation": "Surviving the day and making sure the ventilation shafts remain clear of 'Shade-Clots'.",
            "influence": 2,
            "loyalty": 54,
            "fear": 28,
            "secret": "Saw movement in steam vents.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-09",
            "name": "Darrin Holt",
            "race": "Human",
            "role": "Miner",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474262301577318460/image0.jpg?ex=69993543&is=6997e3c3&hm=8f2187c97c5bf3fc6e192fc1552f4afa670ac913e9c920b0957dbf1696bc63fb&",
            "description": "A tall, gaunt human man with long, soot-covered fingers. He wears a heavy, tattered wool coat over stained mining leathers. His eyes are large and glassy, often staring into the distance as if reading invisible blueprints. He carries an old, dented surveyor's tool and a map case filled with tattered, oil-stained charts. A faint smell of ozone and old parchment clings to him.",
            "bio": "Darrin was an assistant to the colony's original architect before the first Scourge-invasion. He has a photographic memory for the old tunnel layouts, including the ones that the Council claims no longer exist. He is quiet and secretive, often seen sketching in his map-case during meal-breaks.",
            "motivation": "Rediscovering the 'Ancestral Hub'—a legendary chamber he believes contains the key to the mountain's power.",
            "influence": 2,
            "loyalty": 51,
            "fear": 26,
            "secret": "Knows sealed shaft location.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-10",
            "name": "Yoric Vale",
            "race": "Human",
            "role": "Miner",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474263311099891896/image0.jpg?ex=69993633&is=6997e4b3&hm=4e93819fd39e4f9bfd79bde48c54c8c511b06ca9c63b12248841ca6c6b62ba9b&",
            "description": "A broad-shouldered young man with a face full of enthusiasm and soot. He wears a simple, tattered tunic and a pair of reinforced mining trousers that are too short for his long legs. He has a shock of messy, brown hair and bright blue eyes. He carries a basic, heavy-duty pickaxe and a small, cherished militia emblem pinned to his apron. He moves with an earnest, clumsy energy.",
            "bio": "Yoric is a dreamer who sees the miners as the frontline of the Sovereignty. He drastically overestimates his own importance but his cheerful attitude is one of the few things that keeps morale up in the lower shafts. He spends his off-hours following the militia patrols from a distance, mimicking their stances.",
            "motivation": "Earning enough 'Glory-Citations' to be accepted into Garric's personal guard.",
            "influence": 1,
            "loyalty": 49,
            "fear": 18,
            "secret": "Idolizes Garric.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-11",
            "name": "Bran Ulm",
            "race": "Human",
            "role": "Miner",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474263586011353128/image0.jpg?ex=69993675&is=6997e4f5&hm=7caa2c69cfcc76a45f3c67a2d9adeea5c03c0b91c56341bc7eff9e6a976aa04e&",
            "description": "A middle-aged man with a permanent, heavy scowl and a face etched with deep lines of worry. He wears a thick, grease-stained leather vest and has a collection of small, humming crystals woven into his beard. His hands are thick and calloused, with missing fingertips on his left hand. He carries a heavy, arcanotech sledge and a small, locket of tarnished brass. He stands with a slight, protective hunch.",
            "bio": "Bran is a veteran miner who lost his younger brother to a 'Frequency Shift' in the lower tunnels two years ago. He is convinced that the brother is still down there, trapped in a 'Time-Leak', and he spends every shift searching the outlier shafts. He is intensely loyal to those who show him even the slightest bit of empathy.",
            "motivation": "Finding his brother or, failing that, ensuring no other brothers are lost to the 'Singing'.",
            "influence": 2,
            "loyalty": 55,
            "fear": 30,
            "secret": "Brother lost in tunnels.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-12",
            "name": "Kel Dorn",
            "race": "Human",
            "role": "Miner",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474264514009759867/image0.jpg?ex=69993752&is=6997e5d2&hm=88bc901d1d92727d95e3213bf9eddb48aaf769bef073794571efb9265476fce8&",
            "description": "A pale, thin human man with large, dark eyes that seem too big for his head. He wears tattered, oil-stained overalls and a tattered, grey cap. His skin is unnaturally cold to the touch and has a faint, translucent quality. He carries a small, arcanotech frequency-tester that constantly emits a low, mournful hum. He moves with a slow, sleepwalking energy, often stopping to stare into empty darkness.",
            "bio": "Kel was the only survivor of the 'Void-Leak' in Shaft 7. Since then, he has claimed to hear 'the mountain's heartbeat' in a way no one else can. His colleagues find him deeply unsettling, as he often answers questions before they are asked. He is tolerated only because his 'instincts' for stable stone are never wrong.",
            "motivation": "Synthesizing the internal 'Void-Song' he hears to find peace for the spirits of the deep.",
            "influence": 2,
            "loyalty": 50,
            "fear": 32,
            "secret": "Hears whispers underground.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-13",
            "name": "Sella Marr",
            "race": "Human",
            "role": "Farmer",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474264265878933575/image0.jpg?ex=69993717&is=6997e597&hm=1928c87699fb527f2d93d8e70d1714deac019a79817584e407fc7546796a1b48&",
            "description": "A stout human woman in her late 40s. She wears practical, soil-stained trousers and a thick tunic of homespun wool. Her hair is a mass of wild, grey curls tied back with a piece of twine. Her hands are constantly covered in dark, loamy earth. She carries a heavy arcanotech sprinkler and a bag of 'Spark-Infused' seeds. Her expression is one of grim determination as she inspects a withered, blackened stalk of wheat.",
            "bio": "Sella is the head of the Light-Wheat Cooperative. She is a no-nonsense farmer who treats the arcanotech grow-lights with the same reverence a priest treats an altar. She has noticed the first signs of the 'Soil-Rot' but has kept it quiet to prevent a panic, though the black stains on her hands are becoming harder to wash off.",
            "motivation": "Maintaining the calorie-count of the Sovereignty until the 'Black-Soil' can be purified.",
            "influence": 3,
            "loyalty": 56,
            "fear": 24,
            "secret": "Soil turning black.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-14",
            "name": "Dorn Feld",
            "race": "Half-Orc",
            "role": "Farmer",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474264514009759867/image0.jpg?ex=69993752&is=6997e5d2&hm=88bc901d1d92727d95e3213bf9eddb48aaf769bef073794571efb9265476fce8&",
            "description": "A massive Half-Orc with dull, greyish-green skin and a face full of worry. He wears a suit of tattered, reinforced leather and a heavy, dirty apron. His single tusk is cracked and yellowed. He carries a heavy arcanotech pitchfork and a small, humming frequency-pendant. He has a habit of patting the heads of the mutated, three-eyed mountain goats that he treats like his own family. He smells of damp earth and livestock.",
            "bio": "Dorn is the primary caretaker of the colony's 'Frequency-Goats'—creatures that can survive on the mountain's lichen. He is a gentle soul who hates the violence of the tunnels. He has been finding strange, geometric bite-marks on his goats and is terrified that something is coming for the herd.",
            "motivation": "Protecting the 'Life-Stock' from the unseen things that haunt the steam-fields.",
            "influence": 2,
            "loyalty": 53,
            "fear": 30,
            "secret": "Livestock mutilations.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-15",
            "name": "Ilra Fenbrook",
            "race": "Halfling",
            "role": "Farmer",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474265636820619314/image0.jpg?ex=6999385e&is=6997e6de&hm=83726e44ead712eda8b83f0ca5a5debe31f07435b406723cdc28025b4a4e013b&",
            "description": "A small Halfling woman with a face permanently dusted with soot and bright, hopeful eyes. She wears a collection of oversized, tattered scarves and a patchwork tunic of many colors. She carries a small, arcanotech frequency-cradle containing a sleeping, oddly pale child. The child's skin has a faint, translucent quality and seems to pulse with a soft blue light. Ilra speaks in a soft, melodic voice to the child constantly.",
            "bio": "Ilra and her family were among the first to benefit from King Kaelrath's arcanotech medical intervention. Her youngest child was born with 'Frequency-Sickness' and only survived because of a specialized stabilizer. She is fiercely loyal to the King and spends her days tending to the hydroponics while singing lullabies to the mountain.",
            "motivation": "Giving her child a future in a world that doesn't oscillate as dangerously as the one they were born into.",
            "influence": 2,
            "loyalty": 75,
            "fear": 15,
            "secret": "Grateful for Kaelrath's fire; child is currently stabilizing.",
            "corruption_exposure": 5
        },
        {
            "id": "EH-16",
            "name": "Talric Voss",
            "race": "Human",
            "role": "Irrigation Overseer",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474265997333499904/image0.jpg?ex=699938b4&is=6997e734&hm=f2f41fcde508d40ab8b143fa811753b3e64e8fe689e9564b501242f2cb08780d&",
            "description": "A wiry human man with intense, calculating eyes and a face covered in old steam-burns. He wears complex, brass-rimmed pressure-goggles pushed up on his forehead and a heavy leather tool-belt filled with wrenches and frequency-meters. He is draped in a suit of reinforced, waterproof canvas. He carries a long arcanotech rod used for testing valve-resonance. He exudes a sense of constant, pressurized stress.",
            "bio": "Talric is responsible for the massive steam-irrigation system that keeps the colony's farms alive. It is a high-pressure, zero-error job that has left him with a paranoid streak. He is convinced that the fluctuations in Line 4's steam pressure are deliberate sabotage, designed to starve the Sovereignty.",
            "motivation": "Maintaining the 'Fluid-Logic' of the mountain until he can identify the source of the pressure spikes.",
            "influence": 3,
            "loyalty": 62,
            "fear": 24,
            "secret": "Steam pressure rising; suspects sabotage from Line 4.",
            "corruption_exposure": 2
        },
        {
            "id": "EH-17",
            "name": "Kaelin Dusk",
            "race": "Half-Elf",
            "role": "Lead Hunter",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474266321012129863/image0.jpg?ex=69993901&is=6997e781&hm=737a0ac59b1ee76f7d8125c0309331505c078af467ae6b316f4298c4b8be97a9&",
            "description": "A lean, agile Half-Elf with pale skin and eyes the color of twilight. He wears form-fitting armor made from treated Displacer-Hide that seems to shimmer and shift in the light. He is draped in a ghillie-cloak of mountain-lichen and tattered mesh. He carries a recurve bow carved from White-Wood, pulsing with a faint blue arcanotech frequency, and a quiver of crystal-tipped arrows. His face is focused, with faint hunting-tattoos around his eyes.",
            "bio": "Kaelin is the primary tracker for the outlying Ridge. He spent years living alone in the shifting wastes before finding the Sovereignty. He is a man of few words, preferring the silence of the hunt. He has an uncanny ability to read the 'scent' of a Scourge-vibration before it even arrives.",
            "motivation": "Protecting the borders of EmberHeart through silent, preemptive strikes against the Scourge.",
            "influence": 6,
            "loyalty": 57,
            "fear": 28,
            "secret": "Tracks vanish near lava fields.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-18",
            "name": "Bruga Stonejaw",
            "race": "Dwarf",
            "role": "Hunter",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474266683894927504/image0.jpg?ex=69993957&is=6997e7d7&hm=c3cdf67c18561d47a945a7284da052aa2fe56baaa103e40d35b17c78582821ba&",
            "description": "A squat, powerful Dwarf with a jaw as wide as a mountain-base. She wears heavy, reinforced scale-mail of blackened iron and a thick, brown fur-lined hood. Her eyes are small and dark, like coal-shards. She carries a massive, short-handled crossbow that requires a mechanical winch to fire. Her belt is laden with heavy crystal bolts and pouches of pungent sulfur-salve. She smells of smoke and pine.",
            "bio": "A veteran of the subterranean hunts, Bruga doesn't stalk her prey—she anchors against it. She is an expert in tunnel-combat and close-quarters defense. She joined the Sovereignty after her clan's vault was breached by the Singing Death, and she is the first to volunteer for any excursion into the deeper shafts.",
            "motivation": "The absolute extermination of any 'Deep-Thing' that dares enter the light-zones.",
            "influence": 4,
            "loyalty": 60,
            "fear": 24,
            "secret": "Sulfur scent where none should be.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-19",
            "name": "Perri Quickstep",
            "race": "Halfling",
            "role": "Scout",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474267154445504626/image0.jpg?ex=699939c8&is=6997e848&hm=00df4a15b083dbbd92fc9caf80a1277cf072f2f77aa50f1ffa6c4c23ec5fd8cd&",
            "description": "A small, bird-like Halfling with messy, chestnut hair and large, inquisitive hazel eyes. He wears multiple layers of light, tattered linen and leather, reinforced with small plates of frequency-glass at the joints. He carries a collection of small, humming obsidian-anchors used for marking tremors. He moves with a nervous, jerky energy, constantly twitching his ears toward the mountain's floor. He holds a short, arcanotech signal-rod.",
            "bio": "Perri is the youngest and most enthusiastic of the Ridge scouts. He has a 'perfect ear' for seismic rhythms and can distinguish the sound of a falling rock from a Scourge-march at a mile distant. He is often the first to see things that others miss—though sometimes his imagination gets the better of him.",
            "motivation": "Mapping every vibration in the Ridge until the mountain's heart is totally predictable.",
            "influence": 3,
            "loyalty": 52,
            "fear": 22,
            "secret": "Saw shape in night steam.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-20",
            "name": "Varric Emberfall",
            "race": "Dragonborn (Red)",
            "role": "Blacksmith",
            "description": "A massive Red Dragonborn with scales the color of cooled magma, dull and soot-stained. He wears a heavy, scorched leather apron and thick iron-plated gloves. His horns are short and blunt, one of them capped with a heat-resistant copper band. His eyes burn with a low, amber glow, mirroring the forge-fires he tends. He carries a massive, soot-blackened smithing hammer across his shoulder and smells strongly of charcoal and hot metal.",
            "influence": 6,
            "loyalty": 63,
            "fear": 26,
            "secret": "Feels heat pulses from below.",
            "avatar_url": ""
        },
        {
            "id": "EH-21",
            "name": "Nyssa Vale",
            "race": "Tiefling",
            "role": "Herbalist",
            "description": "A slender Tiefling woman with pale, lavender skin and sweeping, jet-black horns that curve back like a predator's. She wears layered, earth-toned robes of rough-spun wool, her pockets overflowing with dried lichen and pungent roots. Her eyes are solid, luminescent white, focused with intense concentration as she inspects a cluster of bioluminescent mushrooms. She carries a gnarled wooden staff adorned with small, tinkling charms and smells of crushed mint and damp earth.",
            "influence": 6,
            "loyalty": 54,
            "fear": 30,
            "secret": "Plants mutating near fissures.",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474263311099891896/image0.jpg?ex=69993633&is=6997e4b3&hm=4e93819fd39e4f9bfd79bde48c54c8c511b06ca9c63b12248841ca6c6b62ba9b&"
        },
        {
            "id": "EH-22",
            "name": "Corin Vale",
            "race": "Human",
            "role": "Militia",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474263311099891896/image0.jpg?ex=69993633&is=6997e4b3&hm=4e93819fd39e4f9bfd79bde48c54c8c511b06ca9c63b12248841ca6c6b62ba9b&",
            "description": "A young human man with a lean, nervous build. He wears a suit of oversized, secondhand militia plate that clatters when he moves. He has a shock of bright blonde hair and a face full of soot-stained freckles. His eyes are wide and constantly scanning the ceiling. He grips a spear with a humming arcanotech tip, his knuckles white with tension. He wears a simple, red-and-grey militia surcoat.",
            "bio": "Corin is a new recruit who was forced into the militia after the last collapse. He is terrified of the dark but even more terrified of letting Garric down. He spends his off-duty hours practicing his thrusts in the training square, driven by a desperate need to find a sense of safety that the mountain continuously denies him.",
            "motivation": "Proving he has the 'Knight's Steel' despite his crushing fear of the deep.",
            "influence": 3,
            "loyalty": 58,
            "fear": 22,
            "secret": "Fears collapse.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-23",
            "name": "Tharok Grin",
            "race": "Half-Orc",
            "role": "Militia",
            "avatar_url": "",
            "description": "A massive Half-Orc with dull, greenish skin and a face covered in old, jagged ritual-scars. He wears heavy, battered splint-mail of dark iron and a wolf-pelt cloak. He has a single, massive tusk that protrudes from his lower lip. His eyes are small and calculating. He carries a heavy, notched battle-axe that smells of old blood and oil. He has a habit of sharpening his tusk with a small whetstone during guard duty.",
            "bio": "Tharok is a former mercenary who saw the 'End-Time' coming and decided that a mountain-fortress was the best place to make a stand. He believes that the refugees are a drain on the Sovereignty's resources and doesn't hide his disdain for them. He is purely loyal to the King's results, not his ideals.",
            "motivation": "Survivial of the strongest; he wants to be part of the force that endures.",
            "influence": 4,
            "loyalty": 46,
            "fear": 20,
            "secret": "Distrusts refugees.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-24",
            "name": "Lira Dawncrest",
            "race": "Human",
            "role": "Militia Archer",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474267714116784170/image0.jpg?ex=69993a4d&is=6997e8cd&hm=f773a2c54145ce3560ea24f7840de93ef90189249be5e151e69524ad7de05f5b&",
            "description": "A human woman with a slight, whip-cord agile build and long, auburn hair tied into a practical braid. She wears light, grey leather armor with deep green accents and a specialized sniper's bracer on her left arm. Her eyes are sharp and amber-toned, catching the dim mountain-light like a predator's. She holds a longbow made of darkened horn, and her quiver is filled with arrows that have frequency-tuned obsidian heads.",
            "bio": "Lira was the finest archer in Garric's original garrison. She has a reputation for being the 'Quiet Eye' of the militia, often stationary for hours on the Outpost battlements. She is intensely private and observant, noticing the small shifts in loyalty and behavior among the populace that others ignore.",
            "motivation": "Maintaining the 'Silent Vigil'; seeing the threat before the threat sees her.",
            "influence": 3,
            "loyalty": 52,
            "fear": 18,
            "secret": "Watching someone secretly.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-25",
            "name": "Fenric Moss",
            "race": "Gnome",
            "role": "Militia Support",
            "avatar_url": "",
            "description": "A small Gnome with a face like a dried plum and wild, white hair that sticks out in all directions. He wears a heavy leather vest covered in pockets, tubes, and glowing vials of blue World-Spark liquid. He has a pair of oversized, brass frequency-goggles pushed up on his forehead. He carries a small, arcanotech signal-repeater that hums and clicks in a rhythmic pattern. He is constantly adjusting small dials on his belt.",
            "bio": "Fenric is a failed engineer from the Spires who found his calling in the 'dirty math' of the Ridge. He provides the militia with real-time tremor-data and arcanotech maintenance. He talks at a breakneck pace, often about 'harmonic convergence' and the 'dissonance of the deep', though few actually understand him.",
            "motivation": "Synthesizing the perfect signal-dampener to render the Sovereignty invisible to the Scourge.",
            "influence": 3,
            "loyalty": 55,
            "fear": 24,
            "secret": "Mapping tremors.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-26",
            "name": "Hesta Rowan",
            "race": "Human",
            "role": "Militia",
            "avatar_url": "",
            "description": "A sturdy human woman with a face etched with grief and determination. She wears worn, heavy-plate gauntlets and a simple, tattered wool surcoat over reinforced chainmail. Her dark hair is cut short and unevenly. Her eyes are red-rimmed and intense, showing a deep, simmering anger. She carries a heavy, spiked mace and a shield of dented iron. She stands with a rigid, unnatural posture.",
            "bio": "Hesta lost her only child to the Line 4 collapse, an event she blames on the council's indecision. Since then, she has become the most aggressive member of the militia, often taking the 'suicide shifts' in the lower tunnels. She doesn't seek survival for herself anymore—only vengeance against the mountain's secrets.",
            "motivation": "Killing the 'Shade' in the darkness before it kills anyone else's child.",
            "influence": 3,
            "loyalty": 59,
            "fear": 26,
            "secret": "Lost child in collapse.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-27",
            "name": "Doren Blackmantle",
            "race": "Dwarf",
            "role": "Militia",
            "avatar_url": "",
            "description": "A heavily-built Dwarf with a beard that has been stone-dyed a deep charcoal grey. He is encased in ancient, heavy plate armor that is intricately carved with Dwarven runes of protection. He wears a thick, soot-stained cloak made of spider-silk. His eyes are small and sharp, constantly analyzing the stonework of any chamber he enters. He carries a massive, square-headed warhammer and a small book of structural diagrams.",
            "bio": "Doren is an expert in arcanotech stonework and ancient tunnel markers. He joined the Sovereignty to ensure that the refugees didn't inadvertently collapse the entire mountain through their ignorance. He is the militia's primary advisor on tunnel-entry and structural fortification. He speaks in short, clipped sentences about stone-stress and ley-line pressure.",
            "motivation": "Building a 'True Vault' where the Scourge's song can never penetrate.",
            "influence": 4,
            "loyalty": 61,
            "fear": 22,
            "secret": "Recognizes ancient tunnel marks.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-29",
            "name": "Selene Varis",
            "race": "Elf",
            "role": "Refugee (Scholar)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474269475032268870/image0.jpg?ex=69993bf1&is=6997ea71&hm=cdf2c41590731ee7a29ca3bc1f738ad1ae54eab74566d0ebb91ed0f00d5adbf3&",
            "description": "An Elf of ethereal, unearthly beauty with skin the color of marble and hair like spun silver. She wears multiple layers of flowing, tattered silks and a necklace of small, humming arcanotech beads. Her eyes are wide and silver-toned, showing a deep, ancient wisdom. She carries a heavy, iron-bound book of 'Deep-Lore' and a quill that leaves a trail of faint blue light. She exudes an aura of profound, scholarly melancholy.",
            "bio": "Selene was one of the librarians of the Great Spires before the purge. She escaped with a handful of 'forbidden' scrolls that detail the mountain's harmonic history. She is intensely private and rarely leaves the refugee-camps, spending her nights deciphering the mountain's 'Earth-Song'. She smells of old parchment and jasmine.",
            "motivation": "Synthesizing the ancient harmonic data to find a way to 'Sing' the mountain into total stability.",
            "influence": 4,
            "loyalty": 50,
            "fear": 15,
            "secret": "Hiding forbidden lore.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-28",
            "name": "Captain Aurelius",
            "race": "Human",
            "role": "Refugee (Former Officer)",
            "avatar_url": "",
            "description": "A man in his late 60s with a military bearing that hasn't bowed to age. He wears a tattered, formal dress uniform of a fallen empire, the gold braid tarnished and frayed. His medals are pinned to a chest that has grown thin from rationing. His face is a network of aristocratic wrinkles and sharp, haunted blue eyes. He carries a ceremonial saber with a broken blade. He smells of old cedar and mothballs.",
            "bio": "Aurelius was a high-ranking officer in the Concordat's Southern Command before the Scourge-invasion. He surrendered his city to save the civilian population and has lived with the shame ever since. He acts as an informal elder for the human refugees, teaching the younger ones about the 'Old World' and the necessity of order.",
            "motivation": "Redeeming his honor by ensuring the safety of the children in the colony, even if it means sacrificing himself.",
            "influence": 5,
            "loyalty": 55,
            "fear": 20,
            "secret": "Surrendered former city.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-30",
            "name": "Ilyra Thornveil",
            "race": "Tiefling",
            "role": "Refugee (Healer)",
            "avatar_url": "",
            "description": "A Tiefling woman with skin the color of bruised plums and small, curved horns that are capped with copper frequency-limiters. She wears simple, earthen-toned robes of heavy wool and a leather belt containing numerous small, glowing glass vials. Her eyes are milky-white but focus with uncanny precision. She carries a staff of gnarled mountain-root topped with a pulsing chunk of frequency-glass. She speaks in soft, rhythmic whispers that sound like rustling leaves.",
            "bio": "Ilyra was a healer in a small, isolated Tiefling community before the Scourge-invasion. She was forced to flee when her village was consumed by the 'Singing Death'. She now serves as the primary healer for the refugee camps, using ancient herbal remedies and arcanotech frequency-therapy to treat the sick and injured. She is fiercely protective of the children.",
            "motivation": "To heal the 'Wounds of the World' and ensure that no more children are lost to the dissonance.",
            "influence": 3,
            "loyalty": 44,
            "fear": 34,
            "secret": "Fled deep-earth cult.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-31",
            "name": "Hobb Rindle",
            "race": "Halfling",
            "role": "Refugee (Scavenger)",
            "avatar_url": "",
            "description": "A small, wiry Halfling with a face like a dried apple and quick, darting eyes. He wears multiple layers of light, tattered linen and leather, reinforced with small plates of frequency-glass at the joints. He carries a collection of small, humming obsidian-anchors used for marking tremors. He moves with a nervous, jerky energy, constantly twitching his ears toward the mountain's floor. He holds a short, arcanotech signal-rod.",
            "bio": "Hobb was a professional scavenger in the outer wastes before the Scourge-invasion. He has an uncanny ability to find hidden caches of supplies and is an expert at navigating the treacherous tunnels. He is fiercely independent and distrustful of authority, but he has a soft spot for the children of the refugee camps.",
            "motivation": "Finding enough 'Spark-Scraps' to ensure his own survival and the survival of those he cares about.",
            "influence": 2,
            "loyalty": 41,
            "fear": 22,
            "secret": "Stealing food stores.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-32",
            "name": "Thalia Greymark",
            "race": "Human",
            "role": "Refugee (Seamstress)",
            "avatar_url": "",
            "description": "A human woman with a slight, whip-cord agile build and long, auburn hair tied into a practical braid. She wears light, grey leather armor with deep green accents and a specialized sniper's bracer on her left arm. Her eyes are sharp and amber-toned, catching the dim mountain-light like a predator's. She holds a longbow made of darkened horn, and her quiver is filled with arrows that have frequency-tuned obsidian heads.",
            "bio": "Thalia was a seamstress in a small, isolated village before the Scourge-invasion. She has an uncanny ability to repair and reinforce clothing and equipment, often using salvaged arcanotech components. She is intensely private and observant, noticing the small shifts in loyalty and behavior among the populace that others ignore.",
            "motivation": "Maintaining the 'Fabric of the Sovereignty'; ensuring that the refugees are clothed and protected from the elements.",
            "influence": 3,
            "loyalty": 52,
            "fear": 26,
            "secret": "Knows herbalist hiding something.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-33",
            "name": "Rusk Feld",
            "race": "Dwarf",
            "role": "Refugee (Miner)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474264514009759867/image0.jpg?ex=69993752&is=6997e5d2&hm=88bc901d1d92727d95e3213bf9eddb48aaf769bef073794571efb9265476fce8&",
            "description": "A squat, powerfully-built Dwarf with a face like a pile of gravel and a beard of dark, braided iron jewelry. He wears tattered, oil-stained leathers and a tattered, grey cap. His left leg is a primitive, heavy iron prosthetic that clanks with every step. He carries a massive, short-handled iron sledgehammer and a cluster of arcanotech frequency-anchors hanging from his belt. He exude a sense of immense, quiet physical power.",
            "bio": "Rusk was a high-grade ore-smelter for the Spires before he was discarded for his injury. He escaped the purge by hiding in a slurry-pipe. He is intensely grateful to King Kaelrath for providing him with a 'functional' leg, however primitive. He is the first to volunteer for the heaviest construction projects.",
            "motivation": "Proving that a 'Shattered-Dwarf' is still more useful than a dozen human laborers.",
            "influence": 2,
            "loyalty": 55,
            "fear": 28,
            "secret": "Hears rumbling at night.",
            "corruption_exposure": 0,
            "cult_allegiance": 0,
            "latent_symptom_flag": false
        },
        {
            "id": "EH-34",
            "name": "Lessa Morn",
            "race": "Human",
            "role": "Refugee (Teacher)",
            "avatar_url": "",
            "description": "A human woman with a kind, gentle face and soft, grey eyes. She wears simple, homespun clothes of muted colors and a small, silver locket around her neck. She carries a worn, leather-bound book of children's stories and a small, carved wooden bird. She exudes a sense of calm and patience, even in the chaos of the refugee camps.",
            "bio": "Lessa was a teacher in a small, isolated village before the Scourge-invasion. She now runs a makeshift school for the children of the refugee camps, teaching them to read and write, and telling them stories of the 'Old World'. She believes that hope is the most important lesson she can impart.",
            "motivation": "Ensuring that the 'Light of Knowledge' continues to burn, even in the darkest of times.",
            "influence": 1,
            "loyalty": 49,
            "fear": 20,
            "secret": "Writing secret letters.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-35",
            "name": "Branick Holt",
            "race": "Human",
            "role": "Refugee (Farmer)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474262301577318460/image0.jpg?ex=69993543&is=6997e3c3&hm=8f2187c97c5bf3fc6e192fc1552f4afa670ac913e9c920b0957dbf1696bc63fb&",
            "description": "A wiry human man with intense, calculating eyes and a face covered in old steam-burns. He wears complex, brass-rimmed pressure-goggles pushed up on his forehead and a heavy leather tool-belt filled with wrenches and frequency-meters. He is draped in a suit of reinforced, waterproof canvas. He carries a long arcanotech rod used for testing valve-resonance. He exudes a sense of constant, pressurized stress.",
            "bio": "Branick was a farmer in the fertile plains before the Scourge-invasion. He is an expert in hydroponics and has been instrumental in establishing the colony's food supply. He is a man of few words, preferring the quiet work of the fields to the politics of the refugee camps. He is deeply suspicious of outsiders.",
            "motivation": "Maintaining the 'Fluid-Logic' of the mountain until he can identify the source of the pressure spikes.",
            "influence": 1,
            "loyalty": 50,
            "fear": 26,
            "secret": "Believes settlement cursed.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-36",
            "name": "Palla Greenbottle",
            "race": "Gnome",
            "role": "Refugee (Engineer)",
            "avatar_url": "",
            "description": "A small Gnome with a face like a dried plum and wild, white hair that sticks out in all directions. He wears a heavy leather vest covered in pockets, tubes, and glowing vials of blue World-Spark liquid. He has a pair of oversized, brass frequency-goggles pushed up on his forehead. He carries a small, arcanotech signal-repeater that hums and clicks in a rhythmic pattern. He is constantly adjusting small dials on his belt.",
            "bio": "Palla is a failed engineer from the Spires who found his calling in the 'dirty math' of the Ridge. He provides the militia with real-time tremor-data and arcanotech maintenance. He talks at a breakneck pace, often about 'harmonic convergence' and the 'dissonance of the deep', though few actually understand him.",
            "motivation": "Synthesizing the perfect signal-dampener to render the Sovereignty invisible to the Scourge.",
            "influence": 3,
            "loyalty": 54,
            "fear": 22,
            "secret": "Tracking seismic rhythm.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-37",
            "name": "Tarek Voss",
            "race": "Human",
            "role": "Refugee (Scout)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474265997333499904/image0.jpg?ex=699938b4&is=6997e734&hm=f2f41fcde508d40ab8b143fa811753b3e64e8fe689e9564b501242f2cb08780d&",
            "description": "A lean, agile human man with pale skin and eyes the color of twilight. He wears form-fitting armor made from treated Displacer-Hide that seems to shimmer and shift in the light. He is draped in a ghillie-cloak of mountain-lichen and tattered mesh. He carries a recurve bow carved from White-Wood, pulsing with a faint blue arcanotech frequency, and a quiver of crystal-tipped arrows. His face is focused, with faint hunting-tattoos around his eyes.",
            "bio": "Tarek is the primary tracker for the outlying Ridge. He spent years living alone in the shifting wastes before finding the Sovereignty. He is a man of few words, preferring the silence of the hunt. He has an uncanny ability to read the 'scent' of a Scourge-vibration before it even arrives.",
            "motivation": "Protecting the borders of EmberHeart through silent, preemptive strikes against the Scourge.",
            "influence": 1,
            "loyalty": 48,
            "fear": 28,
            "secret": "Saw eyes in fissure steam.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-38",
            "name": "Brinna Coalridge",
            "race": "Dwarf",
            "role": "Refugee (Blacksmith)",
            "avatar_url": "",
            "description": "A squat, powerful Dwarf with a jaw as wide as a mountain-base. She wears heavy, reinforced scale-mail of blackened iron and a thick, brown fur-lined hood. Her eyes are small and dark, like coal-shards. She carries a massive, short-handled crossbow that requires a mechanical winch to fire. Her belt is laden with heavy crystal bolts and pouches of pungent sulfur-salve. She smells of smoke and pine.",
            "bio": "Brinna is a veteran of the subterranean hunts, but she doesn't stalk her prey—she anchors against it. She is an expert in tunnel-combat and close-quarters defense. She joined the Sovereignty after her clan's vault was breached by the Singing Death, and she is the first to volunteer for any excursion into the deeper shafts.",
            "motivation": "The absolute extermination of any 'Deep-Thing' that dares enter the light-zones.",
            "influence": 2,
            "loyalty": 57,
            "fear": 24,
            "secret": "Recognizes dwarven rune.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-39",
            "name": "Joric Vale",
            "race": "Human",
            "role": "Refugee (Guard)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474263311099891896/image0.jpg?ex=69993633&is=6997e4b3&hm=4e93819fd39e4f9bfd79bde48c54c8c511b06ca9c63b12248841ca6c6b62ba9b&",
            "description": "A young human man with a lean, nervous build. He wears a suit of oversized, secondhand militia plate that clatters when he moves. He has a shock of bright blonde hair and a face full of soot-stained freckles. His eyes are wide and constantly scanning the ceiling. He grips a spear with a humming arcanotech tip, his knuckles white with tension. He wears a simple, red-and-grey militia surcoat.",
            "bio": "Joric is a new recruit who was forced into the militia after the last collapse. He is terrified of the dark but even more terrified of letting Garric down. He spends his off-duty hours practicing his thrusts in the training square, driven by a desperate need to find a sense of safety that the mountain continuously denies him.",
            "motivation": "Proving he has the 'Knight's Steel' despite his crushing fear of the deep.",
            "influence": 2,
            "loyalty": 45,
            "fear": 18,
            "secret": "Wants leadership.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-40",
            "name": "Mira Dawnfield",
            "race": "Half-Elf",
            "role": "Refugee (Mediator)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1474255101953703968/image0.jpg?ex=69992e8e&is=6997dd0e&hm=712d98f37ec03209e0bf4ee48082da5445328089f489a7bc383311dc4c4ee028&",
            "description": "A Half-Elf woman with a gentle, serene face and eyes the color of a clear summer sky. She wears simple, flowing robes of muted green and brown, and a necklace of polished river stones. She carries a small, leather-bound journal and a quill made from a raven's feather. She exudes a sense of calm and diplomacy, often mediating disputes among the refugees.",
            "bio": "Mira was a diplomat in a small, isolated Half-Elf community before the Scourge-invasion. She has an uncanny ability to find common ground between warring factions and is often sought out for her wisdom and impartiality. She believes that unity is the only way to survive the coming darkness.",
            "motivation": "Building bridges between the disparate factions of the Sovereignty; ensuring that the refugees find a common purpose.",
            "influence": 2,
            "loyalty": 53,
            "fear": 20,
            "secret": "Acting quiet mediator.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-43",
            "name": "Orla Tealeaf",
            "race": "Halfling",
            "role": "Refugee (Cook)",
            "avatar_url": "",
            "description": "A plump Halfling woman with a face full of laugh-lines and flour-smudges. She wears multiple, tattered wool aprons over a bright green dress. Her hair is tied into two messy, chestnut buns. She carries a massive iron ladle like a weapon and is constantly surrounded by the steam of a large, copper soup-kettle. She exudes a sense of overwhelming, motherly competence and smells of roasted onions and yeast.",
            "bio": "Orla ran the most popular inn in the Western Basin before the Spire raids. She now runs the refugee-kitchens, turning the meager rations of moss and grain into something resembling edible food. She is the colony's primary source of gossip and knows exactly who is sleeping with whom—or who hasn't eaten in three days.",
            "motivation": "Keeping the 'Table of the Sovereignty' full, even if she has to cook the King's own boots.",
            "influence": 3,
            "loyalty": 62,
            "fear": 12,
            "secret": "Knows everyone's dirt.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-44",
            "name": "Gorn Ironfoot",
            "race": "Dwarf",
            "role": "Refugee (Laborer)",
            "avatar_url": "",
            "description": "A squat, powerfully-built Dwarf with a face like a pile of gravel and a beard of dark, braided iron jewelry. He wears tattered, oil-stained leathers and a tattered, grey cap. His left leg is a primitive, heavy iron prosthetic that clanks with every step. He carries a massive, short-handled iron sledgehammer and a cluster of arcanotech frequency-anchors hanging from his belt. He exude a sense of immense, quiet physical power.",
            "bio": "Gorn was a high-grade ore-smelter for the Spires before he was discarded for his injury. He escaped the purge by hiding in a slurry-pipe. He is intensely grateful to King Kaelrath for providing him with a 'functional' leg, however primitive. He is the first to volunteer for the heaviest construction projects.",
            "motivation": "Proving that a 'Shattered-Dwarf' is still more useful than a dozen human laborers.",
            "influence": 3,
            "loyalty": 70,
            "fear": 18,
            "secret": "Grateful to Kaelrath.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-45",
            "name": "Elara Moonwhisper",
            "race": "Elf",
            "role": "Refugee (Elder)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473556652627067065/image0.jpg?ex=69989e53&is=69974cd3&hm=06367c6f44c32327942302a1bb21ddbff9b33ba19f30ad569f64af4ded896080&",
            "description": "An elderly Elf woman with skin like fine, cracked porcelain and long, flowing hair of brilliant white. She wears heavy robes of dark purple silk and a necklace of small, humming arcanotech beads. Her eyes are clouded with cataracts but see with uncanny precision. She carries a gnarled staff of White-Wood that pulses with a faint green light. She speaks in soft, rhythmic whispers that sound like rustling leaves.",
            "bio": "Elara is a former matron of the Valemere nature-states. She believes that the 'Singing Death' isn't an invasion, but a natural corrective for the planet's harmonic imbalance. She provides spiritual guidance to the elven refugees, often telling stories of the 'Before-Ages' when the mountain was still silent.",
            "motivation": "Guiding the 'Lost-Children' through the harmonic shadow; ensuring they don't lose their souls to the dissonance.",
            "influence": 4,
            "loyalty": 52,
            "fear": 15,
            "secret": "Believes Scourge is natural.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-46",
            "name": "Kaelen Sunstrider",
            "race": "Elf",
            "role": "Refugee (Warrior)",
            "avatar_url": "",
            "description": "A tall, lithe Elf with a face permanently set in a scowl of intense concentration. He wears light, grey leather armor with deep green accents and a specialized sniper's bracer on his left arm. His eyes are sharp and amber-toned. He holds a longbow made of darkened horn, and his quiver is filled with arrows that have frequency-tuned obsidian heads. He exudes an aura of controlled, lethal energy.",
            "bio": "Kaelen was a guardian of the Valemere borders before the Spires' fire-magic destroyed his home. He blames the Matriarch for her 'softness' and has since become one of the most aggressive defenders of the Sovereignty. He is often the first to volunteer for any recon-mission into the outlier ridge.",
            "motivation": "Vengeance through precision; ensuring that the 'Burners' pay for every hectare of Valemere ash.",
            "influence": 4,
            "loyalty": 60,
            "fear": 12,
            "secret": "Blames Valemere leaders.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-47",
            "name": "Valerius Thorne",
            "race": "Human",
            "role": "Refugee (Scribe)",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473556763923189788/image0.jpg?ex=69989e6d&is=69974ced&hm=865fa5564748f61bc4f0d68ab3318415d0d4cb4111c22649330b9cb90d3005fd&",
            "description": "A young, nervous human man with lanky limbs and ink-stained fingers. He wears multiple layers of tattered, grey linen and a heavy leather tool-belt filled with quills and ink-vials. He carries a tattered, iron-bound book of 'Historical-Deeds' and a small arcanotech signal-rod. His eyes are wide and watery, constantly scanning the crowd for interesting stories. He smells of old vellum and vinegar.",
            "bio": "Valerius was a low-ranking scribe in the Concordat's administration who realized that the 'Official-History' was a lie. He escaped with a collection of censored records that detail the early Scourge-sightings. He currently acts as the colony's unofficial historian, recording the stories of the refugees before they are lost.",
            "motivation": "Ensuring the 'True-Tale' of the Sovereignty survives, even if the Sovereignty itself does not.",
            "influence": 3,
            "loyalty": 54,
            "fear": 25,
            "secret": "Hiding censored records.",
            "corruption_exposure": 0
        },
        {
            "id": "EH-48",
            "name": "Lyra Starcrest",
            "race": "Half-Elf",
            "role": "Refugee (Artist)",
            "avatar_url": "",
            "description": "A woman of indeterminate age with skin the color of marble and hair like spun silver. She wears layered, tattered silks of blue and gold and a necklace of small, humming arcanotech beads. Her eyes are large and silver-toned. She carries a heavy, iron-bound sketchbook and a collection of charcoals made from singed frequency-wood. She exude an aura of profound, creative melancholy and smells of lavender and turpentine.",
            "bio": "Lyra was a renowned muralist in the Trade Basin who lost her sight following a Scourge-beam strike. She has since learned to 'see' through the mountain's harmonic vibrations. She creates bizarre, geometric murals on the cave walls that many find unsettling, as they often depict events before they occur.",
            "motivation": "Synthesizing the mountain's 'Future-Vision' into a visual map that the King can use to navigate the void.",
            "influence": 2,
            "loyalty": 50,
            "fear": 20,
            "secret": "Blind artist sees futures.",
            "corruption_exposure": 10
        },
        {
            "id": "EH-51",
            "name": "Thrum",
            "race": "Spectral Automaton",
            "role": "Warden-Forge Assistant",
            "description": "A floating, semi-translucent construct of bronze plates and glowing blue ley-lines. It has no legs, hovering a few inches above the ground with a rhythmic, mechanical hum. Its arms are multiple, specialized tools—welding torches, precision-grips, and frequency-scanners. Its 'face' is a single, large sapphire lens that pulses with an inquisitive indigo light.",
            "bio": "Thrum is an accidental creation of Haldor Iron-Hand—a repair-bot that was struck by a rogue World-Spark surge and gained a rudimentary, helpful personality. It doesn't speak, instead communicating through a series of rhythmic whistles and holographic projections. It is the unofficial mascot of the Warden-Forge.",
            "motivation": "Maintaining the 'Structural Harmony' of the forge and ensuring Haldor's prosthetic remains at peak efficiency.",
            "loyalty": "Total (Construct)",
            "status": "Functional / Loyal",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473556108101812295/image0.jpg?ex=69989dd1&is=69974c51&hm=1fe6c2bf33dcdef3c7dea6b4d374b3c2c621a05ba43325df0aade9a559458144&"
        },
        {
            "id": "EH-52",
            "name": "Zael",
            "race": "Human (Void-Marked)",
            "role": "Exilled Scout",
            "description": "A gaunt human man with skin that has a faint, iridescent sheen. He wears tattered, oil-stained leathers and a heavy, fur-lined cloak that seems to absorb the light around him. His eyes are solid white and he has a jagged scar across his throat. He carries a short-sword of pitch-black glass and a collection of strange, geometric 'Sign-Coins'. He moves with an unsettling, flickering energy.",
            "bio": "Zael was a scout who was lost in the outliers during the first Scourge-invasion. He returned months later, changed and unable to speak. He was exiled by the Council for his 'Corruption' but has recently been seen lurking near the Ridge-ventilation shafts, leaving warning-signs of upcoming seismic shifts. He is the first 'Void-Marked' human to retain his sanity.",
            "motivation": "Acting as a silent, invisible guardian for the colony that turned its back on him.",
            "loyalty": "Quietly Loyal",
            "status": "Exiled / Watcher",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473556251366658078/image0.jpg?ex=69989df3&is=69974c73&hm=6812dd7d500d50125d04f5100902afc9ea44b68c27df81390b961acf62dc13ed&"
        },
        {
            "id": "EH-57",
            "name": "Kyra",
            "race": "Half-Elf",
            "role": "Refugee Archer",
            "description": "A woman with a lean, whip-cord agile build and long, auburn hair tied into dozens of small, practical braids. She wears light, grey leather armor with deep green accents and a specialized sniper's bracer on her left arm. Her eyes are sharp and amber-toned, catching the dim mountain-light like a predator's. She holds a longbow made of darkened horn, and her quiver is filled with arrows that have frequency-tuned obsidian heads.",
            "bio": "Kyra was one of the many refugees who arrived in the wake of the Star-Shrike's fall. A former forest-guard, she has struggled to adapt to the subterranean life but has found a new purpose in the militia. She is intensely private and observant, noticing the small shifts in loyalty and behavior among the populace that others ignore.",
            "motivation": "Vengeance for her lost homeland; ensuring that the 'Singing Death' stays contained within the Ridge.",
            "loyalty": "Blade-Sworn",
            "status": "Active Militia",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473556966206079130/image0.jpg?ex=69989e9e&is=69974d1e&hm=94fbc650884fe7486473b10021dcea22b5ef33a9612e77f8e215e4b00c975d10&"
        },
        {
            "id": "EH-58",
            "name": "Jax",
            "race": "Half-Orc",
            "role": "Former Saboteur / Laborer",
            "description": "A massive Half-Orc with dull, olive skin and a face crossed by a single, deep crater-like scar on his forehead. He wears simple, tattered mining leathers and a heavy leather apron. His hands are massive and clumsy, but he moves with a surprising, gentle care. He carries a heavy iron shovel and a small, humming frequency-charms around his neck. He smells of damp earth and old grease.",
            "bio": "Jax was part of the original sabotage-attempt on the steam-valves, driven by a cultist's promise of 'Ascension'. After being captured and healed of his mental corruption by Silvara, he has dedicated his life to manual labor as a form of penance. He is often seen clearing the most dangerous rubble-piles.",
            "motivation": "Redeeming himself through hard labor; ensuring that no others fall to the 'False-Song'.",
            "loyalty": "Devoted-Convert",
            "status": "Laborer / Penitent",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473557069813518436/image0.jpg?ex=69989eb6&is=69974d36&hm=001f5a6f766817b61b3b7f52d275725673206fc8f01301cfb35bbbeca183957d&"
        },
        {
            "id": "EH-59",
            "name": "Bramen",
            "race": "Human (Subdued)",
            "role": "Recovering Saboteur",
            "description": "A man in his late 20s with skin that still retains a faint, translucent, grey-violet tint. He wears simple linen clothing and a heavy, arcanotech medical collar that pulses with a stabilizing blue light. His eyes, once solid black, have started to regain their natural brown hue, though the pupils are still oddly square-shaped. He moves with a slow, deliberate energy, as if re-learning how to be human.",
            "bio": "The former 'Prisoner 404'. After the successful harmonic-stabilization performed by the King and his alchemists, Bramen has begun the slow process of recovery. He is the first living subject to be partially 'De-Geometricized'. He possesses a unique, if fragmented, understanding of the Scourge's command-logic.",
            "motivation": "Reclaiming his identity and using his 'Scar-Knowledge' to help the Sovereignty decode the Weaver's next move.",
            "loyalty": "Deeply Grateful",
            "status": "Medical Observation / Advisor",
            "avatar_url": ""
        },
        {
            "id": "EH-60",
            "name": "Silas",
            "race": "Dwarf",
            "role": "Elder Miner",
            "description": "An ancient Dwarf with a beard so long it has to be wound around his waist like a belt. His skin is like cracked leather, permanently stained with a deep, earthy brown. His eyes are milky-white and blind, but he navigates the tunnels with uncanny precision using a gnarled walking-stick that he taps against the floor. He wears heavy, tattered mining leathers and smells of old stone and tobacco.",
            "bio": "Silas is the oldest living resident of EmberHeart, having survived since the first shafts were dug. He knows the 'Heart-Beat' of the mountain better than any map or sensor. He is often consulted by Borin Ashmantle on matters of deep history and the original 'Deep-Vault' locations. He speaks in long, rambling stories about the days when the stone was 'Still'.",
            "motivation": "Ensuring the mountain's 'Quiet-Places' are respected and preserved as the new colony expands.",
            "loyalty": "Neutral-Wise",
            "status": "Honored Elder",
            "avatar_url": ""
        },
        {
            "id": "EH-61",
            "name": "Arin",
            "race": "Human (Spark-Touched)",
            "role": "Child of the Spark",
            "description": "A young boy of around seven years old with skin that glows with a soft, ethereal blue light. His eyes are solid indigo and seem to contain swirling nebulae. He wears simple, clean linen tunics and is often seen carrying a small, humming crystal shard as if it were a toy. He exude a sense of profound, unsettling peace and occasionally hums in a frequency that causes small objects to hover.",
            "bio": "Arin was the first child born within the influence of the World-Spark resonance. He is not corrupted, but 'Adapted'. He has a natural, instinctive interface with arcanotech devices and can occasionally stabilize a collapsing frequency-vent just by being near it. He is treated with a mixture of reverence and fear by the populace.",
            "motivation": "Unknown; he seems to simply 'exist' as a manifestation of the mountain's new life.",
            "loyalty": "Innocent-Harmonic",
            "status": "Special Observation",
            "avatar_url": ""
        },
        {
            "id": "DM-00",
            "name": "The Chronicle Weaver",
            "race": "Spectral Singularity",
            "role": "Architect of Logic / Ghost DM",
            "description": "A faceless, spectral entity draped in shifting robes of obsidian and starlight. They float above a clockwork loom where the threads are Ley-Lines. One hand grips a quill of splintered frequency glass; the other holds a lantern casting indigo Truth-Light.",
            "influence": 10,
            "loyalty": 100,
            "fear": 0,
            "secret": "They are the breath between the dice rolls - the observer that collapses the wave of fate.",
            "motivation": "Maintaining the internal logic and narrative frequency of the EmberHeart universe.",
            "status": "Transcendental / Non-Interventional",
            "avatar_url": "https://cdn.discordapp.com/attachments/1473540819146244218/1473803413988049192/image0.jpg?ex=6998db63&is=699789e3&hm=360d588ced6498ac3a015c976c7f9f770937a355240c130a22b18409a8f711a1&"
        }
    ]
}